Ha20/system/walls/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{   
    PotE
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.0;
        nCellsInCoarsestLevel 500;
        smoother         DICGaussSeidel;
    }
    
    PotEFinal
    {
        $PotE;
        tolerance        1e-6;
        relTol           0;  
    }    
}

PIMPLE
{
}

PotE
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    PotERefCell        0;
    PotERefValue       0;
}

// ************************************************************************* //
